# Taps (most are now built-in)
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/cask-versions"
# tap "homebrew/services"

# Binaries
brew "git"
brew "gh"                # GitHub CLI
brew "wget"
brew "curl"
brew "tree"
brew "jq"                # JSON processor
brew "ripgrep"           # Better grep
brew "fd"                # Better find
brew "bat"               # Better cat
brew "eza"               # Better ls
brew "fzf"               # Fuzzy finder
brew "tmux"
brew "neovim"
brew "zsh"
brew "starship"          # Modern prompt

# Development Tools (languages are managed separately)
# brew "node"     # Use nvm instead
# brew "python"   # Use pyenv instead
# brew "ruby"     # Use rbenv instead
# brew "go"       # Use g (go version manager) instead
# brew "rust"     # Use rustup instead
brew "docker"
brew "docker-compose"

# Database
brew "postgresql@15"
brew "mysql"
brew "redis"
brew "sqlite"

# Applications
cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
cask "iterm2"
cask "slack"
cask "discord"
cask "zoom"
cask "notion"
cask "obsidian"
cask "raycast"           # Better Spotlight
cask "rectangle"         # Window management
cask "stats"             # System monitor
cask "hiddenbar"         # Menu bar manager

# Development Tools
cask "docker"
cask "tableplus"         # Database GUI
cask "postman"
cask "insomnia"          # API client
cask "github"            # GitHub Desktop
cask "sourcetree"        # Git GUI
cask "figma"

# Utilities
cask "the-unarchiver"
cask "appcleaner"
cask "keka"              # Archive tool
cask "iina"              # Media player
cask "imageoptim"        # Image optimizer

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# Mac App Store
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541