# Taps (most are now built-in)
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/cask-versions"
# tap "homebrew/services"

# Binaries
brew "git"               # バージョン管理システム
brew "gh"                # GitHub CLI - GitHubをCLIから操作
brew "wget"              # ファイルダウンロードツール
brew "curl"              # データ転送ツール、API操作に便利
brew "tree"              # ディレクトリ構造をツリー表示
brew "jq"                # JSONデータ処理ツール
brew "ripgrep"           # 高速grep代替（rgコマンド）
brew "fd"                # 高速find代替、ファイル検索
brew "bat"               # シンタックスハイライト付きcat
brew "eza"               # モダンなls代替、アイコン表示対応
brew "fzf"               # あいまい検索、インタラクティブフィルター
brew "tmux"              # ターミナルマルチプレクサ
brew "neovim"            # モダンなVimエディター
brew "zsh"               # 高機能シェル
brew "starship"          # カスタマイズ可能なプロンプト

# Development Tools (languages are managed separately)
# brew "node"     # Use nvm instead
# brew "python"   # Use pyenv instead
# brew "ruby"     # Use rbenv instead
# brew "go"       # Use g (go version manager) instead
# brew "rust"     # Use rustup instead
brew "xcodes"            # Xcodeバージョン管理ツール
brew "docker"            # コンテナプラットフォーム
brew "docker-compose"    # マルチコンテナ管理ツール

# Database
brew "postgresql@15"     # PostgreSQLデータベース v15
brew "mysql"             # MySQLデータベース
brew "redis"             # インメモリKVSデータベース
brew "sqlite"            # 軽量SQLデータベース

# Applications
cask "google-chrome"     # Webブラウザ
cask "firefox"           # Webブラウザ
cask "visual-studio-code" # コードエディター
cask "warp"              # AI搭載モダンターミナル
cask "slack"             # ビジネスチャットツール
cask "discord"           # ボイス＆テキストチャット
cask "zoom"              # ビデオ会議ツール
cask "notion"            # オールインワンワークスペース
cask "obsidian"          # Markdownベースのノートアプリ
cask "raycast"           # Spotlight代替、生産性向上ツール
cask "rectangle"         # ウィンドウ管理、スナップ機能
cask "stats"             # メニューバーのシステムモニター
cask "hiddenbar"         # メニューバーアイコン整理ツール

# Development Tools
cask "docker"            # Docker Desktop - コンテナ管理GUI
cask "tableplus"         # データベース管理GUI
cask "postman"           # API開発・テストツール
cask "insomnia"          # REST/GraphQL APIクライアント
cask "github"            # GitHub Desktop - Git GUI
cask "sourcetree"        # Git GUI、ブランチ管理
cask "figma"             # UIデザインツール

# Games
cask "minecraft"         # Minecraft Java Edition

# Utilities
cask "the-unarchiver"    # 多形式対応の解凍ツール
cask "appcleaner"        # アプリ完全削除ツール
cask "keka"              # 圧縮・解凍ツール
cask "iina"              # モダンな動画プレイヤー
cask "imageoptim"        # 画像圧縮・最適化ツール

# Fonts
cask "font-hack-nerd-font"           # Hackフォント + アイコン
cask "font-jetbrains-mono-nerd-font" # JetBrains Monoフォント + アイコン
cask "font-fira-code-nerd-font"      # Fira Codeフォント + リガチャ + アイコン

# Mac App Store
# mas "Xcode", id: 497799835     # Apple統合開発環境
# mas "Keynote", id: 409183694   # プレゼンテーション作成
# mas "Numbers", id: 409203825   # 表計算アプリ
# mas "Pages", id: 409201541     # ワードプロセッサ